run/abl/fullScaleStrat/fullScaleStratBase/0.orig/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

#include        "$FOAM_CASE/data/ablParams"

internalField   uniform $turbulentEpsilon;

boundaryField
{
  frontField
  {
      type            atmBoundaryLayerInletEpsilon;
      flowDir         (1 0 0);
      zDir            (0 0 1);
      Uref            $flowVelocity;
      Zref            $refHeight;
      z0              uniform $z0;
      zGround         uniform 0.0;
  }
  /*
    frontField
    {
        type            fixedProfile;
        profile         csvFile;
        profileCoeffs
        {
            nHeaderLine         0;
            refColumn           0;
            componentColumns    (1);
            mergeSeparators     no;
            file                "$FOAM_CASE/data/Eps.csv";
            outOfBounds         clamp;
            interpolationScheme linear;
        }
        direction        (0 0 1);
        origin           0;
    }
    */
    backField
    {
        type            zeroGradient;
    }
    sideField
    {
        type            empty;
    }
    top
    {
        type            fixedGradient;
        gradient        uniform   $epsilonShear;
    }
    ground
    {
        type            epsilonWallFunction;
        Cmu             0.09;
        kappa           $vonKarman;
        E               9.8;
        value           $internalField;
    }
    symPlane
    {
        type            empty;
    }
}
// ************************************************************************* //
