run/abl/fullScaleStrat/fullScaleStratBase/0.orig/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "$FOAM_CASE/data/ablParams"

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform $turbulentKE;

boundaryField
{
    frontField
    { 
        type            fixedProfile;
        profile         csvFile;
        profileCoeffs
        {
            nHeaderLine         0;
            refColumn           0;  
            componentColumns    (1); 
            mergeSeparators     no;         
            file                "$FOAM_CASE/data/K.csv";
            outOfBounds         clamp;
            interpolationScheme linear;
        }
        direction        (0 0 1);
        origin           0;
    }
    backField
    {
        type            zeroGradient;
    }
    sideField
    {
        type            empty;
    }
    top
    {
        type            zeroGradient;
    }
    ground
    {
        type            zeroGradient;
    }
    symPlane
    {
        type            empty;
    }
}
// ************************************************************************* //
